results/day05/logs/bench_large_i2048_o256_c4.txt
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7cdc26209440>, trust_remote_code=False, seed=0, num_prompts=16, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=2048, random_output_len=256, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai-chat', base_url='http://127.0.0.1:8000', host='127.0.0.1', port=8000, endpoint='/v1/chat/completions', header=None, max_concurrency=4, model='models/Qwen/Qwen2.5-0.5B-Instruct', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='results/day05/raw', result_filename='day05_large_i2048_o256_c4.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,95,99', goodput=None, request_id_prefix='bench-9f685677-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 06-16 09:10:48 [utils.py:90] Sampling input_len from [2048, 2048] and output_len from [256, 256]
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 4
100%|██████████| 16/16 [00:02<00:00,  6.13it/s]

                             Output tokens per second
  1600 +--------------------------------------------------------------------+
       |***********             ***                                         |
  1400 |                           ****                                     |
       |                               ***                                  |
       |                                  ***                               |
  1200 |                                     ****                           |
       |                                         ***                        |
  1000 |                                            **                      |
       |                                              **                    |
   800 |                                                **                  |
       |                                                  **                |
       |                                                    **              |
   600 |                                                      **            |
       |                                                        **          |
   400 |                                                          **        |
       |                                                            **      |
       |                                                              **    |
   200 |                                                                **  |
       |                                                                  **|
     0 +--------------------------------------------------------------------+
       0          0.5         1          1.5         2          2.5         3

                         Concurrent requests per second
  12 +----------------------------------------------------------------------+
     |                 ****   **                                            |
     |             ****         **                                          |
  10 |         ****               **                                        |
     |     ****                     *                                       |
     | ****                          **                                     |
   8 |*                                **                                   |
     |                                   **                                 |
     |                                     **                               |
   6 |                                       *                              |
     |                                        **                            |
     |                                          **                          |
     |                                            **                        |
   4 |                                              **                      |
     |                                                ****                  |
     |                                                    ****              |
   2 |                                                        ****          |
     |                                                            ****      |
     |                                                                ****  |
   0 +----------------------------------------------------------------------+
     0          0.5          1          1.5         2          2.5          3
============ Serving Benchmark Result ============
Successful requests:                     16        
Failed requests:                         0         
Maximum request concurrency:             4         
Benchmark duration (s):                  2.61      
Total input tokens:                      33232     
Total generated tokens:                  4096      
Request throughput (req/s):              6.13      
Output token throughput (tok/s):         1568.42   
Peak output token throughput (tok/s):    1593.00   
Peak concurrent requests:                12.00     
Total token throughput (tok/s):          14293.48  
---------------Time to First Token----------------
Mean TTFT (ms):                          62.71     
Median TTFT (ms):                        68.32     
P50 TTFT (ms):                           68.32     
P90 TTFT (ms):                           86.71     
P95 TTFT (ms):                           92.10     
P99 TTFT (ms):                           96.98     
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          2.31      
Median TPOT (ms):                        2.30      
P50 TPOT (ms):                           2.30      
P90 TPOT (ms):                           2.42      
P95 TPOT (ms):                           2.42      
P99 TPOT (ms):                           2.42      
---------------Inter-token Latency----------------
Mean ITL (ms):                           2.30      
Median ITL (ms):                         2.23      
P50 ITL (ms):                            2.23      
P90 ITL (ms):                            2.26      
P95 ITL (ms):                            2.28      
P99 ITL (ms):                            2.43      
----------------End-to-end Latency----------------
Mean E2EL (ms):                          651.89    
Median E2EL (ms):                        649.33    
P50 E2EL (ms):                           649.33    
P90 E2EL (ms):                           662.61    
P95 E2EL (ms):                           664.01    
P99 E2EL (ms):                           664.91    
==================================================